Under the Data Analysis below topics are covered.

1. Group By and Having Clause

2. Min() and Max()

3. Sum() and Avg()

**Group By**


**GROUP BY ** Command will check for the Unique Values of Enteries in the Specified Column.

Example: If the Data has 3 Enteries for the Column "SourceOf Joining" as
i.LinkedIN

ii.YouTube

iii. Instagram ...

GROUP BY will count the Number of Enteries in each of these  3 Enteries..
ie .. How many enteries in **LinkedIn**,How many in **YouTub**e and how many in **Instagram**.



This command is used to group categories of a particular Column.

**Points to Remember while writing a Query for Group By:**

1. The Column on which you do Group By should be always there after the SELECT statment.
2. After the SELECT statement followed by Column name on which we are grouping there should be a **Aggregation** statement

** 5 Types of SQL Aggregation commands:**

1. COUNT()
2. SUM()
3. MIN()
4. MAX()
5. AVG()

With the GROUP BY Command only the bove 5 Aggregation Commands need to be used.


**Query1: Count the Number of Students who joined the Course Via LinkedIN ,YouTube,COmmunity**

SELECT SourceOfJoining,COUNT(*) as Tot_num_Students_Each_Grp  FROM Learners
GROUP BY SourceOFJoining;

Output:

SourceOfJoining, Total_Studs

'LinkedIn', '3'

'YouTube', '3'

'Instagram', '1'


** Multiple Columns can be used for Group BY. And those multiple column have to be used immedeatly after the SELECT Statement  ,before using the Aggregation statement**


** NOTE --VERY IMPORTANT**

** For Filteration of Data AFTER GROUP BY Clause we can only use **Having** clause and not the **Where** Clause  




**Example for Multiple column GROUP BY**

SELECT SourceOfJoining,Location ,COUNT(*) as Num_of_Students FROM Learners
GROUP BY SourceOfJoining,Location;


**Query2:Corresponding to each Course how many Students have Enrolled**


SELECT SelectedCourses ,COUNT(*) Num_Students_Per_Course FROM Learners
GROUP BY SelectedCourses;

Output:

SelectedCourses, Students_Per_Course

'1', '2'

'2', '3'

'3', '2'


**Query 3:Corresponding to each Source of Joining ,get the Maximum Years of Experience**

SELECT SourceOfJoining ,MAX(YearsOfExp) FROM Learners
GROUP BY SourceOfJoining;

**Output:**

SourceOfJoining, Max_Yrs_Of_Exp

'LinkedIn', '4'

'YouTube', '8'

'Instagram', '3'


**Query 4: Corresponding to each Source of Joining ,get the Minimum Years of Experience**


SELECT SourceOfJoining ,MIN(YearsOfExp) FROM Learners
GROUP BY SourceOfJoining;

SourceOfJoining  Min_Yrs_Of_Exp

'Instagram', '3'

'LinkedIn', '1'

'YouTube', '1'


**Query 5:Corresponding to each Source of Joining ,get the Average Years of Experience**

SELECT SourceOfJoining,AVG(YearsOfExp) As Avg_Years_Of_Exp FROM Learners
GROUP BY SourceOfJoining;

SourceOfJoining, AVG_Years_Of_Exp

'LinkedIn', '2.6667'

'YouTube', '4.6667'

'Instagram', '3.0000'


**Query 6: Corresponding to each Source of Joining ,get the SUMMATION of Years of Experience**

SELECT SourceOfJoining ,SUM(YearsOfExp) as Tot_Sum_Of_Yrs_Of_Exp FROM Learners
GROUP BY SourceOfJoining;

**Output**

SourceOfJoining, Tot_Sum_Of_Yrs_Of_Exp

'Instagram', '3'

'LinkedIn', '8'

'YouTube', '14'



**ORDER OF EXECUTION OF GROUP BY COMMAND**

FROM ==>SELECT Column Name ==> GROUP BY==>Aggregation Command

**Logical Operators IN SQL -AND,OR ,NOT ,BETWEEN**

**QUERY 1: COMMAND TO DISPALY THE CourseName does not have EXCEL**

SELECT *FROM Course WHERE CourseName NOT LIKE '%EXCEL%';

**Output**

CourseID, CourseName, CourseDuration_Months, CourseFee

'1', 'SQL Bootcamp', '1', '2999'

'2', 'DSA for Interview Preparation', '2', '4999'

'3', 'Complete Excel Mastery Course', '3', '1499'


**QUERY 2: COMMAND TO DISPALY THE CourseName with  SQL**

SELECT *FROM Course WHERE CourseName LIKE '%SQL%';


**Output**

CourseID, CourseName, CourseDuration_Months, CourseFee

'1', 'SQL Bootcamp', '1', '2999'




**Query 2: DISPLAY THE RECORDS WHO HAVE 4 Years of Experience and Source Of Joining YouTube and Location is Delhi**

**When Multiple Constarints need to be satisfied and all of them have to be Satisfied then Use "AND" Operator**

SEELCT *FROM Learners WHERE SourceOfJoining LIKE "YouTube"
AND YearsOfExp>4
AND Location="Delhi";


**Output:**

Learner_Id, LearnerFirstName, LearnerLastName, LearnerEmailID, LearnerPhoneNo, LearnerEnrollmentDate, SelectedCourses, YearsOfExp, LearnerCompany, SourceOfJoining, Batch_Start_Date, Location


'3', 'Madhuram', 'Ravichandran', 'ravichandran.madhuram@gmail.com', '9898887716', '2024-03-21 00:00:00', '3', '5', 'CapGemini', 'YouTube', '2024-03-25 00:00:00', 'Delhi'


**Query 3:Display Records of students who have Experience between 1 and 4 Years**

SELECT *FROM Learners WHERE YearsOfExp BETWEEN 1 AND 4;

**Output**

Learner_Id, LearnerFirstName, LearnerLastName, LearnerEmailID, LearnerPhoneNo, LearnerEnrollmentDate, SelectedCourses, YearsOfExp, LearnerCompany, SourceOfJoining, Batch_Start_Date, Location

'1', 'Akash', 'Mishra', 'akash@gmail.com', '9998887776', '2024-01-21 00:00:00', '1', '4', 'Amazon', 'LinkedIn', '2024-02-29 00:00:00', 'Bengaluru'

'2', 'Akhil', 'George', 'akhil.george.8743@gmail.com', '9998881112', '2024-01-10 00:00:00', '2', '3', 'Microsoft', 'LinkedIn', '2024-01-06 00:00:00', 'Bengaluru'

'4', 'Jeevan', 'Hegde', 'jeevanhegde@yahoo.co.in', '9888887776', '2024-02-01 00:00:00', '1', '3', 'Amazon', 'Instagram', '2024-02-29 00:00:00', 'Mumbai'

'5', 'Sidhish', 'Kumar', 'sidhishkumar@gmail.com', '9917887726', '2024-03-15 00:00:00', '3', '1', 'FaceBook', 'LinkedIn', '2024-03-25 00:00:00', 'Lucknow'

'7', 'Rishikesh', ' Joshi', 'carjkop@gmail.com', '9788887152', '2024-01-02 00:00:00', '2', '1', 'Infosys', 'YouTube', '2024-01-16 00:00:00', 'Indore'

'8', 'Sidhish', 'Kumar', 'sidhish@gmail.com', '9998827776', '2024-01-21 00:00:00', '1', '4', 'Amazon', 'LinkedIn', '2024-01-16 00:00:00', 'Gurugram'

**ALTER COMMAND in SQL is a DDL Command**

1. This command is used when we want to chnge the **Schema** of the Table.
2. This command is a DDL Command.

**ALTER Command to Modify the Schema of the Table employee-Add a new column jobPosition varchar(50)**

**Query1 : ALTER table employee ADD column jobPosition varchar(50);**

This command adds a new column by name"jobPosition" to the employee table.

**Output:**

Field, Type, Null, Key, Default, Extra

'Age', 'int', 'NO', '', NULL, ''
'EmpID', 'int', 'NO', 'PRI', NULL, 'auto_increment'
'FirstName', 'varchar(20)', 'YES', '', NULL, ''
'jobPosition', 'varchar(50)', 'YES', '', NULL, ''
'LastName', 'varchar(20)', 'NO', '', NULL, ''
'Location', 'varchar(20)', 'NO', '', NULL, ''
'Salary', 'int', 'NO', '', NULL, ''


**To Modify the Schema in the existiong table columns - Modify the column FirstName from varchar(50) to varchar(40)**

**Query2 : ALTER table employee MODIFY column FirstName varchar(40);**

**Output**

Field, Type, Null, Key, Default, Extra

'Age', 'int', 'NO', '', NULL, ''
'EmpID', 'int', 'NO', 'PRI', NULL, 'auto_increment'
'FirstName', 'varchar(40)', 'YES', '', NULL, ''
'jobPosition', 'varchar(50)', 'YES', '', NULL, ''
'LastName', 'varchar(20)', 'NO', '', NULL, ''
'Location', 'varchar(20)', 'NO', '', NULL, ''
'Salary', 'int', 'NO', '', NULL, ''

**Interview Question - What is difference between TRUNCATE and DELETE command in SQL?**

Ans-

**DELETE :-**
Delete is used to remove the specific row from the table using WHERE clause .
It Deletes rowone-by-one.

This is like erasing one at a time in a NoteBook

Example:- DELETE FROM employee WhERE Location="Delhi"


**TRUNCATE**
Truncate is used to remove enite rows of the Table and no need of the WHERE Clause.
This is like throwing away the whole book and getting a new one

TRUNCATE is Fast

Example ; TRUNCATE TABLE employee;

**DATA TYPES IN SQL**

1.  **Decimal**

INSERT INTO Course(CourseName,CourseDuration_Months,CourseFee) VALUES("Foundations In Machine Learning",3.5,4499);

When we insert the above data and have CourseDuration_Months as decimal value, ,when we run the above command ..we donot see any error.
We see that the Ciel() operation happens and the data for CourseDuration_Months is converted to 4 instead of 3.5

Output

CourseID, CourseName, CourseDuration_Months, CourseFee

1	SQL Bootcamp	1	2999
2	DSA for Interview Preparation	2	4999
3	Complete Excel Mastery Course	3	1499
4	Foundations In Machine Learning	4	4499



**DECIMAL DATA TYPE**

DECIMAL(3,1) 3===> Precision
             1==> Scale

             Example: 12.5 --Precision =3 (Total Number of Digits is 3)
                             Scale =1 (Number of digits After Decimal point is 1)

**Defining a Variable with Data Type as TIMESTAMP and NOW()**

CREATE TABLE Course_Update(
CourseID INT AUTO_INCREMENT,
CourseName varchar(50)NOT NULL,
CourseDuration_Months DECIMAL(3,1) NOT NULL,
CourseFee INT NOT NULL,
Changed_at TIMESTAMP DEFAULT NOW(),
PRIMARY KEY (CourseID)
);

Here we have defined Changed_at TIMESTAMP DEFAULT NOW().. This will give us the Current Time when the Data was Inserted into the table.


INSERT INTO Course_Update(CourseName,CourseDuration_Months,CourseFee) VALUES("SQL Bootcamp",1,2999);
INSERT INTO Course_Update(CourseName,CourseDuration_Months,CourseFee) VALUES("DSA for Interview Preparation",2,4999);
INSERT INTO Course_Update(CourseName,CourseDuration_Months,CourseFee) VALUES("Complete Excel Mastery Course",2.5,1499);
INSERT INTO Course_Update(CourseName,CourseDuration_Months,CourseFee) VALUES("Foundations In Machine Learning",3.5,4499);


**Output**

CourseID, CourseName, CourseDuration_Months, CourseFee, Changed_at

'1', 'SQL Bootcamp', '1.0', '2999', '2026-02-13 19:11:32'
'2', 'DSA for Interview Preparation', '2.0', '4999', '2026-02-13 19:11:32'
'3', 'Complete Excel Mastery Course', '2.5', '1499', '2026-02-13 19:11:32'
'4', 'Foundations In Machine Learning', '3.5', '4499', '2026-02-13 19:11:32'

**UPDATE COMMAND TO CHANGE THE DATA IN THE TABLE-- Update CourseFees to 3999 for CourseName =SQL BootCamp**

UPDATE Course_Update SET CourseFees =3999
WHERE WHERE CourseID=1;

Output:

CourseID, CourseName, CourseDuration_Months, CourseFee, Changed_at

'1', 'SQL Bootcamp', '1.0', '3999', '2026-02-13 19:11:32'
'2', 'DSA for Interview Preparation', '2.0', '4999', '2026-02-13 19:11:32'
'3', 'Complete Excel Mastery Course', '2.5', '1499', '2026-02-13 19:11:32'
'4', 'Foundations In Machine Learning', '3.5', '4499', '2026-02-13 19:11:32'
'5', 'Statistics for Data Science', '1.5', '3999', '2026-02-13 19:16:04'

**Problem with the above Update Command** -- We obeserve that the Timestamp did not change with the Update Command.

To see that Time Stamp is reflected with the UPDATE Command .>We need to Add the below constants when the Table is created as below:

CREATE TABLE Course_Update(
CourseID INT AUTO_INCREMENT,
CourseName varchar(50)NOT NULL,
CourseDuration_Months DECIMAL(3,1) NOT NULL,
CourseFee INT NOT NULL,
Changed_at TIMESTAMP DEFAULT NOW() ON UPDATE NOW(),
PRIMARY KEY (CourseID)
);